---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailTypeChangeInconsistancyWarningWithResetBtn
source: html/9f005629-a17a-fddd-dd89-99de8b61d608.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailTypeChangeInconsistancyWarningWithResetBtn Property

Some rail type changes are not consistent with your rail instances customization in this project, you can reset them to make them corresponding with your changes.

## Syntax (C#)
```csharp
public static FailureDefinitionId RailTypeChangeInconsistancyWarningWithResetBtn { get; }
```